day03作业:
第一题:
	1.自定义两个变量,初始值自己给出,用if语句获取两个变量的最大值,并输出.
	2.定义int类型变量score,代表成绩,判断成绩是否>=60并且成绩个位数是0,如果满足条件,打印出"合格的成绩",如果不满足条件,则打印出"不是合格的成绩"


第二题:
	分析以下需求，并用代码实现(if语句)：			
	1.功能描述:定义一个变量代表月份，输出对应的季节
	2.要求:
		(1)定义一个整数(代表月份,范围1-12)
		(2)输出该月份对应的季节
			3,4,5春季
			6,7,8夏季
			9,10,11秋季
			12,1,2冬季
		(3)演示格式如下:
			月份:3
			控制台输出:3月份是春季
	

第三题:
	分别定义两个int类型的变量a,b
		1.定义一个方法,求两个数的和,并打印出来
		2.定义一个方法,求两个数的平均数,并打印出来
		3.定义一个方法,看两个数的和是否大于30,如果大于30,就输出 true 否则就输出 false
	调用上述定义的三个方法,分别将a,b当做参数传入,打印出ab变量的和,平均值及 ab的和是否大于30	


	
第四题:
	1.打印1到100之内的整数，但数字中包含9的要跳过（十位包含9，个位包含9）
	2.如：1 2 3 4 5 ....
	

		
第五题:
	求出1-100之间，奇数的个数和所有奇数之和。并在控制台上进行打印
		

第六题:
	分析以下需求，并用while循环将代码实现：
	1.珠穆朗玛峰高度为8848米，有一张足够大的纸，厚度为0.0001米。
	2.请问，折叠多少次，可以折成珠穆朗玛峰的高度。
	

	
第七题:
	求出三位数中所有的水仙花数,并将他们打印到控制台上.求出所有水仙花数的和,并统计共有多少个水仙花数.
	(什么是水仙花数? 一个三位数的 个位的三次方+十位的三次方+百位的三次方等于他本身,那么这个数就是水仙花数)
	例:153   1*1*1+5*5*5+3*3*3=153
 
 
 
第八题:
	1.打印1到100之内的整数，但数字中包含3的要跳过
	2.每行输出5个满足条件的数，之间用空格分隔
	3.如：1 2 4 5 6
		  7 8 9 10 11
		  ...