day05作业:

第一题:
	1.定义一个包含十个元素的int类型的数组。数组元素自己给出
	2.遍历打印出数组元素
	3.求出数组当中的最小值打印出来
	4.求出数组当中的最大值打印出来
	
	
第二题:
	1.定义一个包含五个元素的int类型的数组。数组元素自己给出
	2.将数组当中数据小于10的打印出来
        如果存在，则打印出来，具体的数据
        如果不存在，则打印出来，未找到合适的数据
	
	
第三题:
	需求：
	(1)定义一个int类型的一维数组，内容为{171,72,19,16,118,51,210,7,18}
	(2)求出该数组中满足要求的元素和。
  		要求：求和的元素的个位和十位不能包含7,并且只能为偶数。
	
	

第四题:
	1.定义一个包含十个元素的int类型的数组。数组元素自己给出
	2.定义一个方法,求出该数组的平均数,并返回
	3.在main方法中将该数组中大于平均数的元素打印到控制台上(平均数用2中定义的方法得到)
	
	
第五题:
	1.定义一个包含十个元素的int类型的数组。数组元素自己给出
	2.统计该数组中有多少个大于平均值的元素,在控制台上打印出来.并求和.
	
	
第六题:
	1.现存在如下两个数组:
		int[] arr1 = {1,2,3};
		int[] arr2 = {4,5,6};
	2.要求定义一个方法,将上面两个数组传入,在方法中将两个数组合并,形成一个新的数组,并返回.
		新的数组: arr3 = {1,2,3,4,5,6}
	3.在main方法中调用该方法,将返回的数组遍历打印
	
	
