第一题:
	1: char,byte,short 这三种类型在参与运算时,会首先提升成什么类型?
	2: char和int类型能够相互转换,依赖于什么?
	3: int a = 10; byte b = a; 这段代码有没有问题? 如有问题请改正

	
第二题:	
	byte b1=3,b2=4,b;
	b=b1+b2; 
	b=3+4;
	哪句是编译失败的呢？为什么呢？



第三题:
	 看程序说答案(程序从上往下是连贯的,变量都会根据前面的步骤发生变化)
	 int a = 10;
	 int b = 3;
	 int c = a + b; //c=? 
	 int d = a - b; //d=?  
	 int e = a * b; //e=?  
	 int f = a / b; //f=?  
	 int g = a % b; //g=?  
	 a++;//a=?  
	 ++a;//a=?  
	 b--;//b=?  
	 --b;//b=?  
	 
	 
第四题:
	看程序说答案(程序从上往下是连贯的,变量都会根据前面的步骤发生变化)
	int a = 10;
	a += 2; //a=?  
	a -= 3; //a=?  
	a *= 4; //a=?  
	a /= 5; //a=?  
	a %= 3; //a=?  
	
	
	
第五题:
	1.定义一个变量a, 初始化值自己决定,判断a的值是否大于10,  输出true或false
	
	2.定义一个变量b, 初始化值自己决定,判断a和b的值是否相等, 输出true或false
		
	3.定义一个变量c, 初始化值自己决定,判断c的值是否小于等于a和b的值之和,输出true或false
		
		
		

第六题:
	1.定义一个三位整数，请分别获取该三位数上每一位的数值
	2.例如：定义的整数123的个位、十位、百位，分别是3、2、1
	3.将个位,十位,百位打印出来.


	
